// Все стірлочними!!!!!!!!!
//  - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// const foo = array => {
//     let sum = 0;
//     for (const arrayElement of array) {
//         sum += arrayElement;
//     }
//     return sum / array.length;
// }
// console.log(foo([1,2,3]))


// const foo = array => array.reduce((a,b) => a + b, 0) / array.length
// console.log(foo([1, 2, 3]));


// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
//  const foo = (...args) =>{
//     let min = args[0];
//     let max = args[0];
//     for (const arg of args) {
//         if (arg > max) max = arg;
//         if (arg < min) min = arg;
//     }
//     console.log('max',max);
//     return min;
// }
// let min = foo(2,3,4,5,6,7,8);
// console.log('min',min);


// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// const foo = (n = 5) => {
//       const array = [];
//       for (let i=0; i < n; i++) {
//           array.push(Math.round(Math.random()*100));
//       }
//       return array;
// }
// console.log(foo());


// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// const foo = (n = 5, limit) => {
//       const array = [];
//       for (let i=0; i < n; i++) {
//           array.push(Math.round(Math.random()*limit));
//       }
//       return array;
// }
// console.log(foo(5, 10));




// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
// let reverse = (array) =>{
//     let arr =[]
//     for (let i=array.length - 1;i>=0;i--){
//         arr.push(array[i])
//     }
//     return arr
// }
// console.log(reverse([1,2,3]))

// let reverse = (array) => array.reverse()
// console.log(reverse([1,2,3]))
//
// let foo = (...gap) => {
//
//     let gapElement = [];
//     for (let i = 0; i <= gap.length; i++) {
//         gapElement.push (Math.round(Math.random()*10)) ;
//     }
//     return gapElement;
// }
// console.log(foo(5,10));


//     Переробити на стрілочні функції з попереднього дз
// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// - створити функцію яка обчислює та повертає площу кола з радіусом r
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// -створити функцію, яка приймає масив з 2х об'єктів, та міняє їх місцями.
// let  foo = (array) => {
//     let gap = [];
//     for (let i = array.length -1; i >=0; i--) {
//         gap.push(array[i]);
//     }
//     return gap;
// }
// console.log(foo([1,2]))



// - створити функцію  яка приймає два масиви та скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
//     EXAMPLE:
// [1,2,3,4]
// [2,3,4,5]
// результат
// [3,5,7,9]

// let foo = (array1, array2) => {
//     let arr = [];
//     for (let i = 0; i < array1.length; i++) {
//         arr.push(array1[i] + array2[i])
//     }
//     return arr;
// }
// console.log(foo([1,2,4,6,7,8],[2,3,6,9,3,5]));
//

// функція приймає масив та число 'i' та міняє місцями обєкт який знаходиться в індексі 'i' на 'i+1'

// let someArr = [2, 3, 1, 5, 6]
// let foo = (arr, i) => {
//     debugger;
//     for (let a = 0,temp = 0; a <= arr.length - 1; a++) {
//         if (a === i){
//             temp = arr[i]
//             arr[i]=arr[i+1]
//             arr[i+1] = temp
//         }
//
//     }
//     return arr
// }
// console.log(someArr)
// console.log(foo(someArr,2))


